***reading the csv file***

In [1]:
#important packages are

import pandas as pd   #data operations
import numpy as np    #math operations 
import matplotlib.pyplot as plt   #diagrams/plots
import seaborn as sns      #diagrams/plots

In [2]:
#data set name:visadataset
#read csv file:comma seperated value
#extension:  .csv
#you can read this using pandas package

#read excel file
#exxtension:   .xlsx

In [3]:
#path
#file location+file name+extension
import pandas as pd
path=r"C:\Users\SHASHI PREETHAM\Documents\Nareshit\EDA\Visadataset - Visadataset.csv"
pd.read_csv(path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [4]:
import pandas as pd
path=r"C:\Users\SHASHI PREETHAM\Documents\Nareshit\EDA\Visadataset - Visadataset.csv"
pd.read_csv(path,sep=';')

      case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]

***create dataframes using list***

In [5]:
name=['ramesh','suresh','satish']
age=[30,35,40]
name,age

(['ramesh', 'suresh', 'satish'], [30, 35, 40])

In [6]:
pd.DataFrame()  #step1:make the data frame

Empty DataFrame
Columns: []
Index: []

In [32]:
name,age

(['ramesh', 'suresh', 'sathish'], [30, 40, 40])

In [33]:
d=

In [34]:
d

In [38]:
#step2:provide the data
pd.DataFrame(zip(name,age))

         0   1
0   ramesh  30
1   suresh  40
2  sathish  40

In [42]:
#step3:provide columns
data=zip(name,age)
cols=['Name','Age']                               #we have two types of data they are series and dataframe
                                #series means single column and dataframe means more than two columns that means pre defined
pd.DataFrame(data,columns=cols)                     
#pd.dataframe(zip(name,age),columns=['name','age'])

      name  age
0   ramesh   30
1   suresh   40
2  sathish   40

**step-4**

**provide index**

In [9]:
import pandas as pd
Name=['ramesh','suresh','shashi']
Age=[20,30,40]
data=zip(Name,Age)
cols=['Name','Age']
ind=['A','B','C']
pd.DataFrame(data,columns=cols,index=ind)

     Name  Age
A  ramesh   20
B  suresh   30
C  shashi   40

**step-5**

$add$ $new$ $column$

In [11]:
Name=['ramesh','suresh','shashi']
Age=[20,30,40]
data=zip(Name,Age)
cols=['Name','Age']
ind=['A','B','C']
df=pd.DataFrame(data,columns=cols,index=ind)
df

     Name  Age
A  ramesh   20
B  suresh   30
C  shashi   40

- if we want to add a new column

- df['new column']

- we need to have a list which is having some elements

- that elements need to be equal to number of rows

- city_names=['hyd','blr','chennai']

- df['city']=city_names

In [12]:
city_names=['hyd','blr','chennai']
df['city']=city_names
df

     Name  Age     city
A  ramesh   20      hyd
B  suresh   30      blr
C  shashi   40  chennai

**step-6**

$update$ $the$ $existing$ $column$

- if we want to cretae the new column or update the old column

- both are same way

In [13]:
df['Name']=['swamy','asif','sathwik']
df

      Name  Age     city
A    swamy   20      hyd
B     asif   30      blr
C  sathwik   40  chennai

$drop$ $the$ $column$

- in order to drop the column

- we need to use drop method

- it takes three parameters 
  
    - drop column or row
    
    - mention column name
    
    - axis
     
        - axis=1 reference as column
        
        - axis=0 reference as row
    
    - you want to create a new dataframe or
    
    - you want overwrite the existing dataframe
    
         - inplace=True

In [1]:
df.drop('city',  #column name
       axis=1,  #column
       inplace=True) #overwrite the same
df

NameError: name 'df' is not defined

In [ ]:
name=['ramesh','suresh','sathish']
age=[30,40,40]

df=pd.DataFrame(zip(name,age),
               columns=['name','age'],
               index=['A','B','C'])

In [26]:
df

      name  age
A   ramesh   30
B   suresh   40
C  sathish   40

In [27]:
city_names=['hyd','blr','chennai']
df['city']=city_names

In [28]:
df

      name  age     city
A   ramesh   30      hyd
B   suresh   40      blr
C  sathish   40  chennai

In [29]:
df.drop('city',  #column name
       axis=1,   #column
       inplace=True)  #overwrite the same

In [30]:
df

      name  age
A   ramesh   30
B   suresh   40
C  sathish   40

**step-8**

$drop$ $rows$

In [17]:
df.drop('C',  #column name
       axis=0,  #column
       inplace=True)  #overwrite the same
df

     name  age
A  ramesh   30
B  suresh   40

**step-9**

$save$ $the$ $data$ $frame$

In [18]:
df.to_csv("output.csv")
#while saving index consider as extra column
df.to_excel("putput.xlsx")

In [19]:
#read output csv
pd.read_csv("output.csv")

  Unnamed: 0    name  age
0          A  ramesh   30
1          B  suresh   40

**step-10**

$remove$ $the$ $index$

In [20]:
#to avooid the above problem
#give index=false
df.to_csv("output.csv",index=False)
pd.read_csv("output.csv")

     name  age
0  ramesh   30
1  suresh   40

**create dataframes using dictonary**

In [21]:
d1={"NAME":['ramesh','suresh','sathish'],
   "AGE":[30,35,40]}

pd.DataFrame(d1)

#no need of zip
#no need of column names

      NAME  AGE
0   ramesh   30
1   suresh   35
2  sathish   40